; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-3-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	s14 - location
	p0-5 - location
	p1-0 - location
	p1-8 - location
	p1-10 - location
	p3-4 - location
	p3-5 - location
	p4-0 - location
	p4-5 - location
	p5-6 - location
	p5-8 - location
	p5-11 - location
	p6-1 - location
	p6-3 - location
	p6-13 - location
	p7-12 - location
	p9-6 - location
	p10-7 - location
	p11-1 - location
	p12-11 - location
	p12-13 - location
	p12-14 - location
	p13-4 - location
	p13-8 - location
	p13-9 - location
	p14-2 - location
	p14-3 - location
	p14-5 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s10)
	(at driver3 s3)
	(at driver4 s8)
	(at truck1 s13)
	(empty truck1)
	(at truck2 s9)
	(empty truck2)
	(at truck3 s10)
	(empty truck3)
	(at package1 s13)
	(at package2 s14)
	(at package3 s11)
	(at package4 s0)
	(at package5 s2)
	(at package6 s1)
	(at package7 s6)
	(at package8 s6)
	(at package9 s7)
	(at package10 s9)
	(at package11 s5)
	(at package12 s6)
	(at package13 s8)
	(at package14 s9)
	(at package15 s8)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 32)
	(= (time-to-walk p0-5 s0) 32)
	(= (time-to-walk s5 p0-5) 97)
	(= (time-to-walk p0-5 s5) 97)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 48)
	(= (time-to-walk p1-0 s1) 48)
	(= (time-to-walk s0 p1-0) 76)
	(= (time-to-walk p1-0 s0) 76)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(= (time-to-walk s1 p1-8) 38)
	(= (time-to-walk p1-8 s1) 38)
	(= (time-to-walk s8 p1-8) 34)
	(= (time-to-walk p1-8 s8) 34)
	(path s1 p1-10)
	(path p1-10 s1)
	(path s10 p1-10)
	(path p1-10 s10)
	(= (time-to-walk s1 p1-10) 50)
	(= (time-to-walk p1-10 s1) 50)
	(= (time-to-walk s10 p1-10) 81)
	(= (time-to-walk p1-10 s10) 81)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 11)
	(= (time-to-walk p3-4 s3) 11)
	(= (time-to-walk s4 p3-4) 78)
	(= (time-to-walk p3-4 s4) 78)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 30)
	(= (time-to-walk p3-5 s3) 30)
	(= (time-to-walk s5 p3-5) 51)
	(= (time-to-walk p3-5 s5) 51)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 6)
	(= (time-to-walk p4-0 s4) 6)
	(= (time-to-walk s0 p4-0) 92)
	(= (time-to-walk p4-0 s0) 92)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 58)
	(= (time-to-walk p4-5 s4) 58)
	(= (time-to-walk s5 p4-5) 70)
	(= (time-to-walk p4-5 s5) 70)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 26)
	(= (time-to-walk p5-6 s5) 26)
	(= (time-to-walk s6 p5-6) 57)
	(= (time-to-walk p5-6 s6) 57)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(= (time-to-walk s5 p5-8) 71)
	(= (time-to-walk p5-8 s5) 71)
	(= (time-to-walk s8 p5-8) 68)
	(= (time-to-walk p5-8 s8) 68)
	(path s5 p5-11)
	(path p5-11 s5)
	(path s11 p5-11)
	(path p5-11 s11)
	(= (time-to-walk s5 p5-11) 49)
	(= (time-to-walk p5-11 s5) 49)
	(= (time-to-walk s11 p5-11) 20)
	(= (time-to-walk p5-11 s11) 20)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 28)
	(= (time-to-walk p6-1 s6) 28)
	(= (time-to-walk s1 p6-1) 16)
	(= (time-to-walk p6-1 s1) 16)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(= (time-to-walk s6 p6-3) 99)
	(= (time-to-walk p6-3 s6) 99)
	(= (time-to-walk s3 p6-3) 92)
	(= (time-to-walk p6-3 s3) 92)
	(path s6 p6-13)
	(path p6-13 s6)
	(path s13 p6-13)
	(path p6-13 s13)
	(= (time-to-walk s6 p6-13) 86)
	(= (time-to-walk p6-13 s6) 86)
	(= (time-to-walk s13 p6-13) 12)
	(= (time-to-walk p6-13 s13) 12)
	(path s7 p7-12)
	(path p7-12 s7)
	(path s12 p7-12)
	(path p7-12 s12)
	(= (time-to-walk s7 p7-12) 49)
	(= (time-to-walk p7-12 s7) 49)
	(= (time-to-walk s12 p7-12) 69)
	(= (time-to-walk p7-12 s12) 69)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(= (time-to-walk s9 p9-6) 29)
	(= (time-to-walk p9-6 s9) 29)
	(= (time-to-walk s6 p9-6) 81)
	(= (time-to-walk p9-6 s6) 81)
	(path s10 p10-7)
	(path p10-7 s10)
	(path s7 p10-7)
	(path p10-7 s7)
	(= (time-to-walk s10 p10-7) 66)
	(= (time-to-walk p10-7 s10) 66)
	(= (time-to-walk s7 p10-7) 77)
	(= (time-to-walk p10-7 s7) 77)
	(path s11 p11-1)
	(path p11-1 s11)
	(path s1 p11-1)
	(path p11-1 s1)
	(= (time-to-walk s11 p11-1) 56)
	(= (time-to-walk p11-1 s11) 56)
	(= (time-to-walk s1 p11-1) 4)
	(= (time-to-walk p11-1 s1) 4)
	(path s12 p12-11)
	(path p12-11 s12)
	(path s11 p12-11)
	(path p12-11 s11)
	(= (time-to-walk s12 p12-11) 11)
	(= (time-to-walk p12-11 s12) 11)
	(= (time-to-walk s11 p12-11) 6)
	(= (time-to-walk p12-11 s11) 6)
	(path s12 p12-13)
	(path p12-13 s12)
	(path s13 p12-13)
	(path p12-13 s13)
	(= (time-to-walk s12 p12-13) 84)
	(= (time-to-walk p12-13 s12) 84)
	(= (time-to-walk s13 p12-13) 21)
	(= (time-to-walk p12-13 s13) 21)
	(path s12 p12-14)
	(path p12-14 s12)
	(path s14 p12-14)
	(path p12-14 s14)
	(= (time-to-walk s12 p12-14) 83)
	(= (time-to-walk p12-14 s12) 83)
	(= (time-to-walk s14 p12-14) 14)
	(= (time-to-walk p12-14 s14) 14)
	(path s13 p13-4)
	(path p13-4 s13)
	(path s4 p13-4)
	(path p13-4 s4)
	(= (time-to-walk s13 p13-4) 72)
	(= (time-to-walk p13-4 s13) 72)
	(= (time-to-walk s4 p13-4) 89)
	(= (time-to-walk p13-4 s4) 89)
	(path s13 p13-8)
	(path p13-8 s13)
	(path s8 p13-8)
	(path p13-8 s8)
	(= (time-to-walk s13 p13-8) 6)
	(= (time-to-walk p13-8 s13) 6)
	(= (time-to-walk s8 p13-8) 29)
	(= (time-to-walk p13-8 s8) 29)
	(path s13 p13-9)
	(path p13-9 s13)
	(path s9 p13-9)
	(path p13-9 s9)
	(= (time-to-walk s13 p13-9) 58)
	(= (time-to-walk p13-9 s13) 58)
	(= (time-to-walk s9 p13-9) 31)
	(= (time-to-walk p13-9 s9) 31)
	(path s14 p14-2)
	(path p14-2 s14)
	(path s2 p14-2)
	(path p14-2 s2)
	(= (time-to-walk s14 p14-2) 85)
	(= (time-to-walk p14-2 s14) 85)
	(= (time-to-walk s2 p14-2) 29)
	(= (time-to-walk p14-2 s2) 29)
	(path s14 p14-3)
	(path p14-3 s14)
	(path s3 p14-3)
	(path p14-3 s3)
	(= (time-to-walk s14 p14-3) 99)
	(= (time-to-walk p14-3 s14) 99)
	(= (time-to-walk s3 p14-3) 34)
	(= (time-to-walk p14-3 s3) 34)
	(path s14 p14-5)
	(path p14-5 s14)
	(path s5 p14-5)
	(path p14-5 s5)
	(= (time-to-walk s14 p14-5) 48)
	(= (time-to-walk p14-5 s14) 48)
	(= (time-to-walk s5 p14-5) 26)
	(= (time-to-walk p14-5 s5) 26)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 49)
	(= (time-to-drive s5 s0) 49)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 46)
	(= (time-to-drive s9 s0) 46)
	(link s0 s10)
	(link s10 s0)
	(= (time-to-drive s0 s10) 18)
	(= (time-to-drive s10 s0) 18)
	(link s0 s12)
	(link s12 s0)
	(= (time-to-drive s0 s12) 34)
	(= (time-to-drive s12 s0) 34)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 58)
	(= (time-to-drive s3 s1) 58)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 67)
	(= (time-to-drive s10 s1) 67)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 3)
	(= (time-to-drive s3 s2) 3)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 87)
	(= (time-to-drive s4 s2) 87)
	(link s2 s13)
	(link s13 s2)
	(= (time-to-drive s2 s13) 47)
	(= (time-to-drive s13 s2) 47)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 69)
	(= (time-to-drive s0 s3) 69)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 63)
	(= (time-to-drive s8 s3) 63)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 3)
	(= (time-to-drive s9 s3) 3)
	(link s3 s11)
	(link s11 s3)
	(= (time-to-drive s3 s11) 72)
	(= (time-to-drive s11 s3) 72)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 73)
	(= (time-to-drive s1 s4) 73)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 8)
	(= (time-to-drive s9 s4) 8)
	(link s4 s12)
	(link s12 s4)
	(= (time-to-drive s4 s12) 56)
	(= (time-to-drive s12 s4) 56)
	(link s5 s13)
	(link s13 s5)
	(= (time-to-drive s5 s13) 94)
	(= (time-to-drive s13 s5) 94)
	(link s5 s14)
	(link s14 s5)
	(= (time-to-drive s5 s14) 91)
	(= (time-to-drive s14 s5) 91)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 69)
	(= (time-to-drive s0 s6) 69)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 65)
	(= (time-to-drive s5 s6) 65)
	(link s6 s11)
	(link s11 s6)
	(= (time-to-drive s6 s11) 79)
	(= (time-to-drive s11 s6) 79)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 74)
	(= (time-to-drive s0 s7) 74)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 93)
	(= (time-to-drive s2 s7) 93)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 37)
	(= (time-to-drive s3 s7) 37)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 5)
	(= (time-to-drive s8 s9) 5)
	(link s9 s13)
	(link s13 s9)
	(= (time-to-drive s9 s13) 77)
	(= (time-to-drive s13 s9) 77)
	(link s10 s2)
	(link s2 s10)
	(= (time-to-drive s10 s2) 66)
	(= (time-to-drive s2 s10) 66)
	(link s10 s5)
	(link s5 s10)
	(= (time-to-drive s10 s5) 4)
	(= (time-to-drive s5 s10) 4)
	(link s10 s6)
	(link s6 s10)
	(= (time-to-drive s10 s6) 11)
	(= (time-to-drive s6 s10) 11)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 13)
	(= (time-to-drive s7 s10) 13)
	(link s10 s11)
	(link s11 s10)
	(= (time-to-drive s10 s11) 30)
	(= (time-to-drive s11 s10) 30)
	(link s10 s14)
	(link s14 s10)
	(= (time-to-drive s10 s14) 60)
	(= (time-to-drive s14 s10) 60)
	(link s11 s5)
	(link s5 s11)
	(= (time-to-drive s11 s5) 59)
	(= (time-to-drive s5 s11) 59)
	(link s11 s8)
	(link s8 s11)
	(= (time-to-drive s11 s8) 47)
	(= (time-to-drive s8 s11) 47)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 94)
	(= (time-to-drive s9 s11) 94)
	(link s11 s12)
	(link s12 s11)
	(= (time-to-drive s11 s12) 17)
	(= (time-to-drive s12 s11) 17)
	(link s12 s2)
	(link s2 s12)
	(= (time-to-drive s12 s2) 13)
	(= (time-to-drive s2 s12) 13)
	(link s12 s10)
	(link s10 s12)
	(= (time-to-drive s12 s10) 96)
	(= (time-to-drive s10 s12) 96)
	(link s13 s0)
	(link s0 s13)
	(= (time-to-drive s13 s0) 3)
	(= (time-to-drive s0 s13) 3)
	(link s13 s14)
	(link s14 s13)
	(= (time-to-drive s13 s14) 60)
	(= (time-to-drive s14 s13) 60)
	(link s14 s8)
	(link s8 s14)
	(= (time-to-drive s14 s8) 65)
	(= (time-to-drive s8 s14) 65)
	(link s14 s11)
	(link s11 s14)
	(= (time-to-drive s14 s11) 65)
	(= (time-to-drive s11 s14) 65)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s12)
	(at truck3 s5)
	(at package1 s5)
	(at package2 s7)
	(at package4 s5)
	(at package5 s0)
	(at package6 s4)
	(at package7 s12)
	(at package8 s11)
	(at package9 s5)
	(at package10 s0)
	(at package12 s13)
	(at package13 s10)
	(at package14 s10)
	(at package15 s12)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 2  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver2 truck3 s10)
   deleted: (at driver2 s10) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 0 of 15
2. (drive-truck truck3 s10 s0 driver2)
   deleted: (at truck3 s10)
   added: (at truck3 s0)
   changed: (driven) from 0 to 18
   goals met: 0 of 15
3. (load-truck package4 truck3 s0)
   deleted: (at package4 s0)
   added: (in package4 truck3)
   goals met: 0 of 15
4. (drive-truck truck3 s0 s10 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s10)
   changed: (driven) from 18 to 36
   goals met: 0 of 15
5. (drive-truck truck3 s10 s14 driver2)
   deleted: (at truck3 s10)
   added: (at truck3 s14)
   changed: (driven) from 36 to 96
   goals met: 0 of 15
6. (load-truck package2 truck3 s14)
   deleted: (at package2 s14)
   added: (in package2 truck3)
   goals met: 0 of 15
7. (drive-truck truck3 s14 s10 driver2)
   deleted: (at truck3 s14)
   added: (at truck3 s10)
   changed: (driven) from 96 to 156
   goals met: 0 of 15
8. (drive-truck truck3 s10 s0 driver2)
   deleted: (at truck3 s10)
   added: (at truck3 s0)
   changed: (driven) from 156 to 174
   goals met: 0 of 15
9. (drive-truck truck3 s0 s9 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s9)
   changed: (driven) from 174 to 220
   goals met: 0 of 15
10. (load-truck package14 truck3 s9)
   deleted: (at package14 s9)
   added: (in package14 truck3)
   goals met: 0 of 15
11. (load-truck package10 truck3 s9)
   deleted: (at package10 s9)
   added: (in package10 truck3)
   goals met: 0 of 15
12. (drive-truck truck3 s9 s0 driver2)
   deleted: (at truck3 s9)
   added: (at truck3 s0)
   changed: (driven) from 220 to 266
   goals met: 0 of 15
13. (unload-truck package10 truck3 s0)
   deleted: (in package10 truck3)
   added: (at package10 s0)
   goals met: 1 of 15
14. (drive-truck truck3 s0 s5 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (driven) from 266 to 315
   goals met: 2 of 15
15. (unload-truck package4 truck3 s5)
   deleted: (in package4 truck3)
   added: (at package4 s5)
   goals met: 3 of 15
16. (drive-truck truck3 s5 s6 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (driven) from 315 to 380
   goals met: 2 of 15
17. (load-truck package7 truck3 s6)
   deleted: (at package7 s6)
   added: (in package7 truck3)
   goals met: 2 of 15
18. (load-truck package8 truck3 s6)
   deleted: (at package8 s6)
   added: (in package8 truck3)
   goals met: 2 of 15
19. (load-truck package12 truck3 s6)
   deleted: (at package12 s6)
   added: (in package12 truck3)
   goals met: 2 of 15
20. (drive-truck truck3 s6 s10 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s10)
   changed: (driven) from 380 to 391
   goals met: 2 of 15
21. (unload-truck package14 truck3 s10)
   deleted: (in package14 truck3)
   added: (at package14 s10)
   goals met: 3 of 15
22. (drive-truck truck3 s10 s12 driver2)
   deleted: (at truck3 s10)
   added: (at truck3 s12)
   changed: (driven) from 391 to 487
   goals met: 3 of 15
23. (unload-truck package7 truck3 s12)
   deleted: (in package7 truck3)
   added: (at package7 s12)
   goals met: 4 of 15
24. (drive-truck truck3 s12 s2 driver2)
   deleted: (at truck3 s12)
   added: (at truck3 s2)
   changed: (driven) from 487 to 500
   goals met: 4 of 15
25. (load-truck package5 truck3 s2)
   deleted: (at package5 s2)
   added: (in package5 truck3)
   goals met: 4 of 15
26. (drive-truck truck3 s2 s12 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s12)
   changed: (driven) from 500 to 513
   goals met: 4 of 15
27. (drive-truck truck3 s12 s0 driver2)
   deleted: (at truck3 s12)
   added: (at truck3 s0)
   changed: (driven) from 513 to 547
   goals met: 4 of 15
28. (unload-truck package5 truck3 s0)
   deleted: (in package5 truck3)
   added: (at package5 s0)
   goals met: 5 of 15
29. (drive-truck truck3 s0 s10 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s10)
   changed: (driven) from 547 to 565
   goals met: 5 of 15
30. (drive-truck truck3 s10 s11 driver2)
   deleted: (at truck3 s10)
   added: (at truck3 s11)
   changed: (driven) from 565 to 595
   goals met: 5 of 15
31. (unload-truck package8 truck3 s11)
   deleted: (in package8 truck3)
   added: (at package8 s11)
   goals met: 6 of 15
32. (drive-truck truck3 s11 s12 driver2)
   deleted: (at truck3 s11)
   added: (at truck3 s12)
   changed: (driven) from 595 to 612
   goals met: 6 of 15
33. (drive-truck truck3 s12 s0 driver2)
   deleted: (at truck3 s12)
   added: (at truck3 s0)
   changed: (driven) from 612 to 646
   goals met: 6 of 15
34. (drive-truck truck3 s0 s13 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s13)
   changed: (driven) from 646 to 649
   goals met: 6 of 15
35. (load-truck package1 truck3 s13)
   deleted: (at package1 s13)
   added: (in package1 truck3)
   goals met: 6 of 15
36. (unload-truck package12 truck3 s13)
   deleted: (in package12 truck3)
   added: (at package12 s13)
   goals met: 7 of 15
37. (drive-truck truck3 s13 s5 driver2)
   deleted: (at truck3 s13)
   added: (at truck3 s5)
   changed: (driven) from 649 to 743
   goals met: 8 of 15
38. (drive-truck truck3 s5 s10 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s10)
   changed: (driven) from 743 to 747
   goals met: 7 of 15
39. (drive-truck truck3 s10 s1 driver2)
   deleted: (at truck3 s10)
   added: (at truck3 s1)
   changed: (driven) from 747 to 814
   goals met: 7 of 15
40. (load-truck package6 truck3 s1)
   deleted: (at package6 s1)
   added: (in package6 truck3)
   goals met: 7 of 15
41. (drive-truck truck3 s1 s10 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s10)
   changed: (driven) from 814 to 881
   goals met: 7 of 15
42. (drive-truck truck3 s10 s5 driver2)
   deleted: (at truck3 s10)
   added: (at truck3 s5)
   changed: (driven) from 881 to 885
   goals met: 8 of 15
43. (unload-truck package1 truck3 s5)
   deleted: (in package1 truck3)
   added: (at package1 s5)
   goals met: 9 of 15
44. (drive-truck truck3 s5 s10 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s10)
   changed: (driven) from 885 to 889
   goals met: 8 of 15
45. (drive-truck truck3 s10 s12 driver2)
   deleted: (at truck3 s10)
   added: (at truck3 s12)
   changed: (driven) from 889 to 985
   goals met: 8 of 15
46. (drive-truck truck3 s12 s4 driver2)
   deleted: (at truck3 s12)
   added: (at truck3 s4)
   changed: (driven) from 985 to 1041
   goals met: 8 of 15
47. (unload-truck package6 truck3 s4)
   deleted: (in package6 truck3)
   added: (at package6 s4)
   goals met: 9 of 15
48. (drive-truck truck3 s4 s12 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s12)
   changed: (driven) from 1041 to 1097
   goals met: 9 of 15
49. (drive-truck truck3 s12 s11 driver2)
   deleted: (at truck3 s12)
   added: (at truck3 s11)
   changed: (driven) from 1097 to 1114
   goals met: 9 of 15
50. (drive-truck truck3 s11 s8 driver2)
   deleted: (at truck3 s11)
   added: (at truck3 s8)
   changed: (driven) from 1114 to 1161
   goals met: 9 of 15
51. (load-truck package15 truck3 s8)
   deleted: (at package15 s8)
   added: (in package15 truck3)
   goals met: 9 of 15
52. (drive-truck truck3 s8 s11 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s11)
   changed: (driven) from 1161 to 1208
   goals met: 9 of 15
53. (drive-truck truck3 s11 s12 driver2)
   deleted: (at truck3 s11)
   added: (at truck3 s12)
   changed: (driven) from 1208 to 1225
   goals met: 9 of 15
54. (unload-truck package15 truck3 s12)
   deleted: (in package15 truck3)
   added: (at package15 s12)
   goals met: 10 of 15
55. (drive-truck truck3 s12 s10 driver2)
   deleted: (at truck3 s12)
   added: (at truck3 s10)
   changed: (driven) from 1225 to 1321
   goals met: 10 of 15
56. (drive-truck truck3 s10 s7 driver2)
   deleted: (at truck3 s10)
   added: (at truck3 s7)
   changed: (driven) from 1321 to 1334
   goals met: 10 of 15
57. (load-truck package9 truck3 s7)
   deleted: (at package9 s7)
   added: (in package9 truck3)
   goals met: 10 of 15
58. (drive-truck truck3 s7 s3 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s3)
   changed: (driven) from 1334 to 1371
   goals met: 10 of 15
59. (drive-truck truck3 s3 s8 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s8)
   changed: (driven) from 1371 to 1434
   goals met: 10 of 15
60. (load-truck package13 truck3 s8)
   deleted: (at package13 s8)
   added: (in package13 truck3)
   goals met: 10 of 15
61. (drive-truck truck3 s8 s14 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s14)
   changed: (driven) from 1434 to 1499
   goals met: 10 of 15
62. (disembark-truck driver2 truck3 s14)
   deleted: (driving driver2 truck3)
   added: (at driver2 s14) (empty truck3)
   goals met: 10 of 15
63. (walk driver2 s14 p12-14)
   deleted: (at driver2 s14)
   added: (at driver2 p12-14)
   changed: (walked) from 0 to 14
   goals met: 10 of 15
64. (walk driver3 s3 p14-3)
   deleted: (at driver3 s3)
   added: (at driver3 p14-3)
   changed: (walked) from 14 to 48
   goals met: 10 of 15
65. (walk driver3 p14-3 s14)
   deleted: (at driver3 p14-3)
   added: (at driver3 s14)
   changed: (walked) from 48 to 147
   goals met: 10 of 15
66. (walk driver2 p12-14 s12)
   deleted: (at driver2 p12-14)
   added: (at driver2 s12)
   changed: (walked) from 147 to 230
   goals met: 11 of 15
67. (board-truck driver3 truck3 s14)
   deleted: (at driver3 s14) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 11 of 15
68. (drive-truck truck3 s14 s5 driver3)
   deleted: (at truck3 s14)
   added: (at truck3 s5)
   changed: (driven) from 1499 to 1590
   goals met: 12 of 15
69. (unload-truck package9 truck3 s5)
   deleted: (in package9 truck3)
   added: (at package9 s5)
   goals met: 13 of 15
70. (drive-truck truck3 s5 s10 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s10)
   changed: (driven) from 1590 to 1594
   goals met: 12 of 15
71. (unload-truck package13 truck3 s10)
   deleted: (in package13 truck3)
   added: (at package13 s10)
   goals met: 13 of 15
72. (drive-truck truck3 s10 s7 driver3)
   deleted: (at truck3 s10)
   added: (at truck3 s7)
   changed: (driven) from 1594 to 1607
   goals met: 13 of 15
73. (unload-truck package2 truck3 s7)
   deleted: (in package2 truck3)
   added: (at package2 s7)
   goals met: 14 of 15
74. (drive-truck truck3 s7 s0 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s0)
   changed: (driven) from 1607 to 1681
   goals met: 14 of 15
75. (drive-truck truck3 s0 s5 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (driven) from 1681 to 1730
   goals met: 15 of 15
